#2.2.2  浮点型
#算术运算符7个：+  -  *  /   //整除   **幂指数   %余数

#输入3.3*102
#>>> 3.3*102
#336.59999999999997
#<class 'float'>
print(3.3*102)
print(type(3.3*102))

#输入3.3*102+15.5
#>>> 3.3*102+15.5
#352.09999999999997
#<class 'float'>
print(3.3*102+15.5)
print(type(3.3*102+15.5))

#输入336.6+15.5
#>>> 336.6+15.5
#352.1
#<class 'float'>
print(336.6+15.5)
print(type(336.6+15.5))

#输入153/51.0
#>>> 153/51.0
#3.0
#<class 'float'>
print(153/51.0)
print(type(153/51.0))

#输入155/51.0
#>>> 155/51.0
#3.0392156862745097
#<class 'float'>
print(155/51.0)
print(type(155/51.0))

#输入155//51.0
#>>> 155//51.0
#3.0
#<class 'float'>
print(155//51.0)
print(type(155//51.0))

#输入155%51.0
#>>> 155%51.0
#2.0
#<class 'float'>
print(155%51.0)
print(type(155%51.0))
