#4.2.1  字符串格式化符号
# \n  \' %s  %  %d   %f
print ('精诚所至\n金石为开')
#精诚所至
#金石为开


#>>> print (''精诚所至'\n'金石为开'')  #不使用转义字符，error
#SyntaxError: invalid syntax

print ('\'精诚所至\'\n\'金石为开\'') #使用\’转义字符
#'精诚所至'
#'金石为开'


#4.2.1  字符串格式化符号
print ('hello,%s' % 'world')
#hello,world

print ('小智今年%s岁了' % 10)
#小智今年10岁了

print ('小智今年%s岁了' % 11)  #使用%s作为10的占位符
#小智今年11岁了

print ('小智今年%d岁了' % 12)  #使用%d作为10的占位符
#小智今年12岁了

print ('圆周率PI的值为：%f' % 3.14)
#圆周率PI的值为：3.140000

print ('圆周率PI的值为：%.2f' % 3.14)
#圆周率PI的值为：3.14

print ('小智的识别能力比去年提高了：%.2f' % 1.23+'%')
#小智的识别能力比去年提高了：1.23%

print ('小智的识别能力比去年提高了：%.2f%%' % 1.26)
#小智的识别能力比去年提高了：1.26%

print ('输出百分号:%s' % '%')
#输出百分号:%




#4.2.2  字符串格式化元组,('2016','冠军',26)圆括号内为元组
print ('今年是%s年，中国女排夺得本届奥运会%s，中国共获得%d枚金牌'%('2016','冠军',26))
#今年是2016年，中国女排夺得本届奥运会冠军，中国共获得26枚金牌

#>>> print ('今年是%s年，中国女排夺得本届奥运会%s，中国共获得%d枚金牌' % '2016','冠军',26)
#Traceback (most recent call last):
#  File "<pyshell#149>", line 1, in <module>
#    print ('今年是%s年，中国女排夺得本届奥运会%s，中国共获得%d枚金牌' % '2016','冠军',26)
#TypeError: not enough arguments for format string


#1. 简单转换
print ('圆周率PI的值为：%.2f' % 3.14)
#圆周率PI的值为：3.14
print ('石油价格为每桶：$%d' % 96)
#石油价格为每桶：$96


#2. 字段宽度和精度
print ('圆周率PI的值为：%10f' % 3.141593) #字段宽度为10
#圆周率PI的值为：  3.141593  #字符串宽度为10，被字符串占据8个空格，剩余两个空格

print ('保留2位小数，圆周率PI的值为：%10.2f' % 3.141593) #字段宽度为10
#保留2位小数，圆周率PI的值为：      3.14    #字符串宽度为10，字符串占据4个，剩6个

print ('保留2位小数，圆周率PI的值为：%.2f' % 3.141593)
#保留2位小数，圆周率PI的值为：3.14  #输出，没有字段宽度参数

print ('字符串精度获取：%.5s' % ('hello world'))#打印字符串前5个字符
#字符串精度获取：hello

print ('从元组中获取字符串精度：%*.*s' % (10,5,'hello world'))
#从元组中获取字符串精度：     hello  #输出字符串宽度为10、精度为5

print ('从元组中获取字符串精度：%.*s' % (5,'hello world'))
#从元组中获取字符串精度：hello #输出精度为5


#3. 符号、对齐和0填充
print ('圆周率PI的值为：%010.2f' % 3.141593)
#圆周率PI的值为：0000003.14

print ('圆周率PI的值为：%10.2f' % 3.14)
#圆周率PI的值为：      3.14

print ('圆周率PI的值为：%-10.2f' % 3.14)
#圆周率PI的值为：3.14      #此处右侧为多出的空格

print(('% 5d' %10)+'\n'+('% 5d' %-10))
#   10
#  -10

print(('宽度前加加号：%+5d'%10)+'\n'+('宽度前加加号：%+5d'%-10))
#宽度前加加号：  +10
#宽度前加加号：  -10

