#2.6.2  算术运算符7个：+, -, *, /,  //,  %,      **
#                     _加_减_乘_除_整除_模(余数)_幂指数
a=10
b=5
print(a+b)  #a+b=10+5=15
#15
print(a-b)  #a-b=10-5=5
#5
print(a*b)  #a*b=10*5=50
#50
print(a/b)  #a/b=10/5=2.0
#2.0

print(9//2)      #整除，舍去小数部分，非四舍五入,9//2=4.5=4
#4
print(9.0//2.0)  #整除，舍去小数部分，非四舍五入,9.0//2.0=4.5=4.0
#4.0

print(a%b) #%求余数,a%b=10/5=2余数0
#0
print(5%3) #%求余数,a%b=5/3=1余数2
#2

print(a**b)  #10的5次方=10^5=10*10*10*10*10=100000
#100000
print(2**32/1024/1024/1024)
#4.0
print(2**64/1024/1024/1024)
#17179869184.0



